Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, MAYA'S WORLD.tmx
Source language: id
Languages: en

source: GYAAA!!!
en: waaa!!!

source: SEKOLAH UDAH
en: school knows

source: GANGGU, AKU
en: but I want

source: FOTO INI HARUSNYA ADA DUA… SATU LAGI MANA…
en: there should be two of them. where’s the other one?

source: Gua bertahan dengan perasaan itu, setolol apa pun caranya, karena gua gak mau jadiin lu pelarian gua karena gua gak bisa menggapai Maya.
en: I kept doing what I had to do to keep my feelings, no matter how foolish it was. I didn’t want to make you my safety net, a place to stay when I couldn’t be with maya.

source: TAKUT AMA
en: are afraid of

source: Berdatangan...
en: to the party.

source: BELAKANG LAGI.
en: to the back of the school.

source: NGGAK ADA.
en: no, I’m all clean.

source: Gak usah, udah gak perlu.
en: no need.

source: Gua gak tau apakah penjelasan dari gua ini bisa bawa kita kembali kayak dulu…
en: I’m not sure if this will make us return to how things were once.

source: JUGA HARUS
en: pay you,

source: DRAP
en: stomp

source: KITA YANG PALING
en: but we still

source: NGEBANTUIN GUE
en: to help me

source: ABISIN!!!!
en: just finish your meal!

source: tuh kan bener masalah cewek, bimo traktir sotboy!
en: see? I was right. he and his girl are at loggerheads! now you owe us some *soto!

source: TRUS GUE
en: and then,

source: Gak ada yang perlu lu benerin lagi.
en: there’s nothing for you to fix anymore.

source: Gue pengen minta maaf…
en: I want to apologize...

source: Saya udah jelasin semuanya.
en: I’ve explained everything.

source: JATOH,
en: fell

source: AKU MAU NGULANG DEH!
en: so I decided to start over!

source: TADI GUE LIHAT KITTY DI BAWAH.
en: I saw kitty on my way here.

source: SURVEY KE
en: a field

source: WARUNG KOPI PURNAMA Sejak 1930
en: purnama coffee shop since 1930

source: ANAK SAYA
en: I’d given

source: KAYAKNYA
en: hmm... I don’t think

source: IYA JUGA, AYU
en: I shouldn’t

source: Gua gak mau kita udahan, tapi gua nggak bisa kayak gini terus sama lu, gua bakal terima semua keputusan lu.
en: I don’t want this to be the end for us, but I can’t do this any longer. so, whatever decision you make, I’ll accept it.

source: ARTINYA MAMA UDAH TAU… SOAL HUBUNGAN SAYA SAMA RADI…?
en: so... mom already knows about my relationship with radi?

source: KOK
en: where are

source: GUA NGUMPETIN
en: not trying

source: Halo adeeek! gimana urusan internship kamu udah beres, nak?
en: hello, my dear boy! have you finished preparing for the internship?

source: KESELAMATAN
en: about your

source: TIAP ANGKATAN, TAPI
en: would choose that topic.

source: menolongnya
en: with all his might.

source: BUAT NYARI
en: to find

source: NYIMPEN INI.
en: still keeping this.

source: RADI!!
en: wait!

source: Gua sayang banget sama lu.
en: I really love you. I do.

source: Siapa…?
en: but who?

source: TA?
en: with your thesis yet?

source: MENGGUNAKAN POWER GUE DI SEKOLAH,
en: if I had used my power at school,

source: Mungkin Lebih
en: should do it

source: TERSERAK KAMU, BEBAS AJA!!
en: anything you like, just pose!

source: CARI TEMPAT
en: some empty

source: woi... anjing...
en: hey! you bastards...

source: bentar bentar, foto dulu buat jadi dp grup angkatan wqwqwq
en: oh, wait! lemme photograph him and set it as the display picture for our group chat, hahaha!

source: SEMUANYA DARI
en: to keep you guys

source: aku yakin kamu bisa ngelewatin semua ini.
en: I'm sure you'll be able to get through it all.

source: ADA TAMU!!!
en: someone’s here!

source: gambar & cerita: tupaikidal
en: art & story: tupaikidal

source: PAK IPIN
en: mr. ipin,

source: bersama
en: with his

source: LULUS AJA.
en: for now, okay?

source: SAMA… FOTO INI…SIAPA YANG NEMUIN…
en: and who found this picture?

source: GUE SENENG AKHIRNYA BISA NGOBROL BAIK-BAIK LAGI SAMA LO SETELAH SEKIAN TAHUN.
en: I’m glad we’ve been able to reconnect after such a long time.

source: KESELAMATAN KAMU
en: and stay safe,

source: Ting Tong!
en: ding dong

source: GUE KAN NGGAK SERING KE SINI?!!
en: it’s not like I come here often.

source: Takut dan
en: feel uncomfortable

source: DIKASIH MANDAT
en: to

source: SIBUK SAMA
en: finish

source: GINI?!
en: way!!!

source: PILIHAN KAMU
en: artwork...

source: DIA KAYAK
en: he seemed

source: NAK, TOLONG PERHATIIN
en: I want you to be careful

source: Dia kemana sih…
en: where the hell is he?!

source: KE-KERETA LO
en: um...

source: KENAPA
en: been

source: jadi dia beli itu buat bacaan baru...
en: she bought that book for her new reading material.

source: Cerita ini adalah fiktif belaka, Jika ada kesamaan nama tokoh, tempat kejadian, ataupun cerita, itu adalah kebetulan semata dan tidak ada unsur kesengajaan.
en: this is a work of fiction. any similarity to actual persons, living or dead, or actual events, is purely coincidental.

source: LO TUH PASTI SERING PAPASAN YA SAMA RADI?
en: I bet you see radi every day.

source: SAYA HARUS
en: I think we should

source: tapi nggak apa-apa! entah kenapa saya malah lebih lega, aneh ya?
en: but it’s okay now! I don’t know why, but I feel relieved about all of this. isn’t it weird?

source: POSENYA MAU KAYAK APAAN NIH?!
en: how should we pose?!

source: YAAH… KALO NGGAK SALAH MAYA DULU BILANG RADI TUH KERJA SAMBIL KULIAH SIH…
en: maya also once told me that he’d been working while attending college.

source: BINTANG KAN LAGI CUTI KULIAH, DIA LAGI DI SURABAYA…
en: isn’t he in surabaya on a semester’s leave?

source: JAUH YA...
en: from here, right?

source: Jatuh Cinta
en: with

source: BUKANNYA LO SENDIRI YANG BILANG MAU BERESIN MASALAH LO SAMA LARAS?!
en: didn’t you tell me you wanted to settle things with her?!

source: AH UDAHLAH,
en: well,

source: nggak bisa dateng...?
en: he won’t come?

source: kesepian
en: wolf.

source: PENTING DAH
en: everything’s clear now,

source: Gua harus ke Bekasi minggu depan.
en: I’m going to bekasi next week.

source: ukh iya... huks... aku juga harus ke dosbing abis ini...
en: oh... okay. I also need to discuss my thesis with my supervisor.

source: DI TUGAS AKHIR KAMU,
en: of your thesis,

source: YANG ADA SAYA MALAH MAKIN MUNDUR, DAN SAYA NGGAK AKAN MENJADI MANUSIA YANG RASIONAL.
en: if that were the case, it would only make me feel inferior and think irrationally.

source: maya
en: world

source: TOPIK PENELITIAN
en: try to tackle

source: Karena sewaktu-waktu bakal gue tempatin?!
en: that room is exclusively for me!

source: Kamu biasanya kalo nggak milih warna kuning, ya pink.
en: last time I checked, you like yellow and pink!

source: DEH!!!
en: it!!!

source: Gua bener-bener nggak tau harus ngapain lagi…
en: I really don’t know what to do anymore.

source: KERETANYA
en: the train will depart

source: DULUAN KE
en: had moved

source: … refreshing…?
en: something fun?

source: HARUSNYA LO
en: you should

source: teman-teman
en: friends.

source: Abis ini kita ke toko langganan mama ya!
en: let’s go to my favorite store after this, okay?

source: DAN NGEJAR SIDANG
en: she’s had

source: AKU HARUS
en: hmm...

source: Hhh… yaudah, kita pulang, hubungin mbak di rumah lo buat bikin yang anget-anget.
en: huff... let’s just go home. call and ask the others to prepare something warm for you.

source: KALO GITU MAU LIAT AJA SOAL PERFORMANCE ART?
en: then what about watching some performing arts instead?

source: Kalo lo kepo kenapa nggak lo cobain aja sendiri?
en: tsk... if you’re curious about the taste, just try one!

source: DIA TIBA-TIBA ILANG
en: seeing him

source: BEKASI DULU
en: to Bekasi

source: SAYA EMANG
en: I feel like

source: DIA SELALU
en: she said

source: Nggak dikasih tau lagi mereka ngobrolnya mau berapa lama…
en: she didn’t tell me that it would take this long.

source: set
en: hug

source: BAKAL TERJADI...
en: happened.

source: GANTI RUGI,
en: to pay

source: Oke kalo gitu panggil saya 'Kak Maya'!
en: hahaha! now you have to call me “maya noona”!

source: PERSONAL APA?
en: to write your current thesis?

source: PENTING
en: is very

source: SEBUAH EFEK SAMPING, YANG HARUS GUE
en: and it’s a bitter aftertaste

source: NGGAK NYANGKA
en: I didn’t know

source: MENGHARGAI
en: respect

source: DIA DITELPON PUN NGGAK PERNAH JAWAB DARI KEMAREN…
en: I can’t get through to him these days.

source: Saya nggak bisa ngomong apa-apa lagi saat itu…
en: I didn’t know what to say anymore. I was lost for words.

source: MESIN KATANYA.
en: to break the machine.

source: CUMA...
en: but...

source: mungkin sesuatu yang gak sempet terucap.
en: something left unsaid...

source: SREK
en: rustle

source: Dengan begitu… gue bisa punya kesempatan ngobrolin soal perasaan gue…
en: then I’d have the chance to talk to you about my feelings.

source: GITU?
en: huh?!

source: OH...
en: hmm...

source: DIA IKUT AJA
en: was

source: PUN JUGA...
en: can’t be helped.

source: Ogah.
en: hell no!

source: Nggak… maksud gua bukan gitu…
en: no... you got it wrong, maya...

source: WAH,
en: whoa,

source: LU NUNGGUIN
en: was waiting

source: Cuma…
en: but...

source: NTAR KASIH
en: just tell them

source: MEREKA ADA
en: happened

source: 'KAN DIA BERHASIL MENJALANI SEMUANYA SAMPAI SIDANG, PADAHAL TUGAS AKHIRNYA SEMPET NGULANG?
en: she managed to get to her thesis defense even though she had to start over from scratch.

source: DIMANA...
en: put them now, huh?

source: YAUDAH GAK APA-AOA, GAK PERLU BASA-BASI SEGALA, LANGSUNG TANYA AJA.
en: it won’t be a problem. just get right to the point and ask them about him.

source: SAMA
en: a

source: SIH?
en: home. Huff...

source: DOKTER YA.
en: a doctor.

source: DOANG YA?
en: on a rough patch.

source: KELUARGA YANG HARUS
en: take care of

source: AWAS
en: don’t you dare

source: CUMA CARI
en: if you only

source: KE JEPANG
en: once you

source: Sebelum gue ditemukan, semua hutang budi ini harus gue selesaikan!
en: before he can find me, I need to repay all of my debts.

source: DUG!
en: thud

source: OH NGGAK,
en: oh,

source: LALU GIMANA DENGAN KITA YANG TERUS MENGISI YANG LAIN, TAPI KITA NGGAK MENGISI DIRI KITA SENDIRI SAMPAI PENUH?
en: then what about those of us who continue to fill the void for others without ever doing the same for ourselves?

source: tapi bagaimana pun juga, ibu juga nggak bisa memaksa kamu...
en: but at the end of the day, it’s all up to you, maya...

source: INTERNSHIP DI
en: on your

source: NGGAK BISA NGAPA-NGAPAIN.
en: I can’t do anything.

source: Nggak selamanya makanan murah itu nggak enak, nih cobain dulu segigit biar lo nggak bawel.
en: just because it’s cheap doesn’t mean it tastes terrible, okay? here, have a bite and then tell me what you think.

source: JEPANGNYA YA,
en: internship,

source: baik kelayakan... dan hal-hal yang gak selesai di diri kamu...
en: your test, your feelings, and everything else you haven’t accomplished yet...

source: DENGAN APA YANG
en: doing what

source: YA GIMANA
en: I know,

source: Gua terlalu takut mengakui bahwa gua sebenernya suka sama Maya.
en: I was too afraid to admit that I liked maya.

source: ITU, GUE UDAH
en: those bullies

source: PADAHAL GUA MAU AJAK JALAN-JALAN DI TROTOARNYA.
en: I was gonna take you for a walk on the sidewalk,

source: AJA ADEKMU
en: let your sister

source: MALAH SAYA
en: blabbered

source: Biasanya makanan murah 'kan nggak enak?
en: I thought cheap foods were supposed to taste terrible?!

source: BU KALEM AJA,
en: it.

source: NAK!
en: okay?

source: RADI, GUE NGGAK
en: well, I don’t know

source: KARYA ANAK-ANAK
en: some of the

source: LOH, TAU
en: what, seriously,

source: GUE TELPON LAGI
en: I guess I’ll call her again

source: karena kamu lebih membutuhkan kerja kelompok daripada kerja sendirian, maya.
en: because I wanted you to learn how to collaborate with others, maya.

source: Cklek!
en: click

source: URUSAN KITA BELOM KELAR, TAU?!
en: we still have unfinished business, remember?!

source: DIA GETOL
en: how much

source: NGOMONG
en: you talk

source: Sampai semua ini selesai.
en: until everything is done.

source: YANG DISARANKAN
en: method.

source: JANGAN-JANGAN NYASAR?!
en: he couldn’t have gotten lost, could he?

source: Gue punya alasan yang harus lo dengerin.
en: I had my reasons... and you should know them.

source: Oh saya temen sekampusnya Bu.
en: oh, yes... we go to the same university.

source: Sayang sekali Larasati Ayudia Kusumaatmadja, hari ini bukan hari beruntung kamu!
en: too bad, larasati ayudia kusumaadmadja! today’s not your lucky day!

source: NTAR GUA
en: I’ll tell

source: NANTI GUA ANTER BALIK AJA, SI BIMO BARU BALIK JADI MOTORNYA BISA GUA PENJEM.
en: I’ll take you home. I’ll be able to use bimo’s motorcycle now that he’s home.

source: TAPI
en: but

source: SELAKU KETUA
en: as the class president,

source: MASIH 30 MENIT
en: in thirty minutes,

source: JAMES
en: was in love

source: SET
en: put

source: SEKARANG
en: why are you

source: AKU SEBENARNYA MASIH NGGAK ENAK SAMA KAMU… KARENA KEKACAUAN INI JUGA BERASAL DARI AKU ‘KAN…
en: I’m sorry for what I’ve done because I’m the one who started this whole mess...

source: BAKAL JAUH SAMA
en: since I’m gonna be away

source: SAYA MALAH JADI PENGHAMBAT SEGALA HAL, SAYA MENGHAMBAT RADI.
en: I was a hindrance in every way, especially in radi’s life.

source: MAKSUD
en: so you’re saying

source: CUMA SEDIH AJA
en: but it’s just kinda sad,

source: ADA YANG KAMU SEMBUNYIKAN DARI LARAS?
en: are you hiding something from her?

source: setelah kejadian skripsi ngulang ini, saya jadi semakin paham sama mau saya.
en: after being instructed to rewrite my thesis, I’ve started to realize what I really want.

source: AGAK SOREAN,
en: in the afternoon.

source: GUA,
en: internship.

source: SAYA KEMAREN MAEN PERGI AJA TAPI NGGAK NANYA SOAL JADWAL SIDANG KAMU!
en: for leaving without asking about your thesis defense schedule.

source: GUE CLUELESS AJA, NGGAK MUNGKIN ‘KAN GUE SAMPERIN KE SURABAYA?
en: I just don’t know what to do. there’s no way I’d go to surabaya just to see him, right?

source: KALIAN KIRA-KIRA TAU ALAMAT DIA DI BEKASI NGGAK?
en: do you have any idea where he is now?

source: TAPI ENTAH KENAPA AKU MERASA…
en: but somehow, I feel...

source: DEH, THANKS
en: thanks,

source: KAK AIS…!
en: ais!

source: zona
en: maya’s

source: gambar & cerita: tupai kidal | @cergaroma | @1percentstudio
en: art & story: tupaikidal | @cergaroma | @1percentstudio

source: aap boyola
en: boyolali

source: TOLONG
en: listen,

source: ACARA KELULUSAN,
en: our graduation,

source: Dan saya sedang ingin mengembalikan kepercayaan mama saya, dan itu susah…
en: I’ve been working hard to earn back her trust... and it’s been tough.

source: AKU BUKAN ORANG YANG AMBIS, HAHAHA… KALO AKU NGGAK SUKA YA AKU TINGGALIN AJA.
en: you know, I’m not that driven, so I tend to ignore things that I don’t like.

source: PERSONAL?
en: drive?

source: Loh 'kan gue bilang kamar itu harus selalu dikosongin?!
en: how many times should I tell you to keep that room empty?!

source: KEBERUNTUNGAN,
en: a lucky charm,

source: NISCAYA AKAN
en: it’ll

source: KAYAK GITU BIKIN
en: disappear like that

source: ZREK
en: whirr

source: dah ya, gua balik dulu mau mandi.
en: okay, bye. I need to shower.

source: karena kamu sendiri nampaknya belum siap.
en: because you don’t seem to be ready for this.

source: iya ma... di antara semua barang pindahan, ini yang paling banyak dan berat...
en: yeah... among all her things, her books were the heaviest to carry.

source: hm...?
en: hmm?

source: NGGAKNYA KE
en: to your thesis defense

source: IYA, IYA,
en: yup

source: Kalo lu mau emang maunya kita jalan masing-masing…
en: if you want us to go our separate ways...

source: RADI, GUE
en: I’m

source: DULU?!
en: too?

source: HAHH...
en: huff...

source: KALIAN, GUA BELOM
en: in the dark.

source: MAAF KALO
en: sorry,

source: FES, GUE DIMINTA
en: I was just asked

source: MASIH TINGKAT
en: I’m still in

source: JADINYA BERANTAKAN,
en: my thesis...

source: GAK USAH LO
en: I don’t think

source: BEKASI.
en: to bekasi.

source: MENIT LAGI
en: in about

source: APA KITA TANYA YOLA SI BIGOS DP?
en: should we ask yola, the gossip queen?

source: SAYA BANTUIN?
en: a hand?

source: INI AKU MAU NGASIH KARTON KATANYA PERLU BUAT T.A….
en: I’ve been looking for him because he said he needed some cardboard for his final project--

source: Dah ya, sekalian panggilin tukang bersih-bersihnya, gue alergi debu!
en: huff... get me a room service and clean my room. make sure it’s spotless!

source: untung aja sambel, saos sama kecapnya dipisah.
en: luckily, I haven’t mixed the sambal and the sweet soy sauce yet.

source: GITU KE DOSBINGKU!
en: then I can give him a surprise, haha!

source: BUAT CERITA-CERITA,
en: to us,

source: TERPAKU
en: be too fixated

source: Lah?
en: well...

source: DULU YA...
en: okay?

source: CARI MANGSA
en: the time,

source: GIMANA CARANYA BUAT NGGAK
en: how could I possibly

source: Lalu?
en: and?

source: sikapmu membuat
en: He was making

source: SAMA MASALAH
en: a connection

source: takutnya dia emang sengaja ninggalin ini di kosan, karena mungkin barang ini mengganggu dia.
en: I've been reluctant to return it to her. this book might’ve irritated her to the point where she decided to leave it.

source: INTERNSHIP
en: where will you

source: DIHUBUNGI,
en: in touch with you,

source: HALO...?
en: hello...?

source: PADAHAL… AKU SENDIRI YANG MENDORONG LARAS BUAT BEGITU?
en: even though I'm the one who made her the way she is now.

source: …NGGAK MUNGKIN GUE KASIH TAU MAMA JUGA… NANTI MALAH… MAKIN-MAKIN SUASANANYA.
en: if I tell mom about this, it’ll only complicate things.

source: NUKER TIKET
en: the last time she tried

source: Ribet deh lo?!!!
en: you want me to bash your face in?!

source: TIAP JAM PULANG
en: and beating you up

source: KARENA TERLALU BANYAK SAYA NGGAK BISA MENANGGUNG SEMUANYA, SAYA JADI NGGAK BERFUNGSI DENGAN BAIK.
en: because there was too much to handle, I was unable to perform at my best.

source: KARENA SAYA MENCERITAKAN SEGALA HAL TENTANG SAYA KE RADI, TAPI RADI NGGAK MELAKUKAN SEBALIKNYA, MENURUT SAYA NGGAK ADIL.
en: I told radi everything about myself, but radi didn’t do the same for me, so I thought it was really unfair.

source: YAUDAH NANTI DICETAK DUA KALI AJA.
en: it’s okay. we’ll just print it twice.

source: BIKIN PEDAL?
en: who started pedal.

source: ILANG?!!
en: my cilors*?!

source: …soal Laras.
en: it’s about laras.

source: Duh udah lama deh mama nggak ke sini, kainnya bagus-bagus!
en: it’s been a while since my last visit here! the quality of the clothes and materials has always been great here.

source: MAMA MENGETAHUI SESUATU TENTANG SAYA…
en: that she knew something about me.

source: GIMANA YA,
en: I guess the reason

source: gambar & cerita: tupaikidal | @cergaroma | @1percentstudio
en: art & story :tupaikidal | @cergaroma | @1percentstudio

source: LAIN AJA
en: pick up

source: MAKASIH
en: thank you.

source: KELUARGA GUA NANTI
en: for quite

source: episode 55 Semua Demi Diri Sendiri
en: episode 55 for my own sake

source: KALAU AJA DIA
en: had she

source: NGAMBILIN
en: artworks

source: TAPI KENAPA KAMU NGGAK COBA TANYA LARAS AJA?
en: oh, I think you should see laras. maybe she can help you.

source: GUE NGGAK SUKA
en: I don’t like

source: GUE KESEL BANGET
en: made me

source: Beneran kok ma, Maya emang sudah waktunya fokus skripsi.
en: I am, mom. I know it’s time for me to focus on my thesis.

source: GUE NEMU
en: this book

source: LARAS SIDANG JAM BRAPA?
en: so, when are you gonna present your thesis?

source: AKU CARIIN
en: for

source: UDAH MAU
en: planning to

source: JADI KAMU
en: so you can start preparing

source: NGULANG KULIAH,
en: to start over.

source: TELAN PAHIT-PAHIT.
en: I had to swallow.

source: IYA,
en: mm-hmm,

source: LU SETAN
en: that doppelgangers

source: NGGAK.
en: nope.

source: UWA!
en: wow!

source: BEDA YA
en: so it’s not

source: BINGUNG HAHA...
en: I’ve got to keep up, hahaha...

source: EH!?
en: huh?

source: SOAL MASALAH YANG LALU NGGAK PERLU KAMU PUSINGKAN LAGI.
en: you don’t have to worry about things that happened in the past.

source: GUA URUSIN, GUA
en: my family business first

source: JAMAN SEKARANG
en: everything

source: YA?
en: over?

source: KALO LO LAGI SUSAH FOKUS GINI, MENDING GUE PULANG AJA.
en: if you can’t concentrate right now, I’d better leave.

source: MAU SAYA
en: do you

source: UDAH DEH,
en: nah...

source: GUE KEHILANGAN
en: I lost

source: UMM...
en: um...

source: BRRRT
en: bzzt

source: HAH?!!
en: huh?!

source: YAAA… KALO GUA SIH MAUNYA NGAJAKIN LU JALAN DI BRAGA.'
en: well... I was going to walk you around braga,

source: REFERENSI
en: specific

source: Kenapa dia masih ada padahal gue udah menemukan penggantinya?
en: why do these feelings still exist even though I’ve already found someone new?

source: HAHA… NGGAK, KAMU DARI TADI NGELIATIN BUKU AKU.
en: haha... nothing. but the way you looked at my book was pretty funny.

source: TAPI GIMANA
en: it

source: kenapa gua gak pernah sadar...?
en: I should’ve realized this sooner...

source: TING NONG!
en: ding dong

source: JEJAKNYA, NGELIAT
en: his tracks.

source: BELOM BU,
en: not yet,

source: IBU NGOBROL,
en: with me.

source: Kalo bicara soal egois, gua juga egois kok, Ras.
en: I’ve been selfish too, laras.

source: Apa nggak terlalu buru-buru mikirin baju wisuda sekarang…?
en: don’t you think it’s a bit too soon for us to do this?!

source: DEPAN...
en: tuesday.

source: MAYAAA!
en: maya!

source: MENJADI JAMES.
en: I’ve become James.

source: LANGSUNG.
en: for my thesis.

source: OOOH!!
en: oh!

source: LOH?!
en: bintang?

source: Y-YA...
en: y-yes,

source: YA NAK, AYO
en: let’s go find

source: …GUE PENGEN TAU SOAL DIA DAN RADI SAAT INI… TAPI… APA DIA NYAMAN KALAU GUE TANYAIN SOAL INI…?
en: I’d like to ask her about her relationship with radi... but is it okay if I do that?

source: SEKARANG DIA NUNGGUIN LO BUAT NGELUARIN MASALAH LO SAMA DIA!!!
en: and now she’s waiting for you to work things out with her as well!!!

source: TUH KERJAAN
en: one of the seniors

source: Hah… Kenapa ma…?
en: huh? why?

source: NGEREPOTIN
en: I left

source: TERSERAH RADI, KAN KAMU YANG NGAJAK SAYA.
en: you asked me to come, so I’ll go wherever you want.

source: Menyadari betapa egoisnya gue bikin gue nggak mampu ngelanjutin kata-kata.
en: I couldn’t say anything after I realized that I was so selfish.

source: Kemane lu anjir gua cariin di kampus!
en: where have you been?! I’ve been looking for you!

source: LAGI...
en: much time.

source: lo kira keluarga gue mafia?
en: it’s not like my family is a part of the mafia.

source: GUE KEMAREN KETEMU BINTANG.
en: I ran into bintang yesterday.

source: Oke Pak, makasih banyak.
en: okay, sir. thank you so much.

source: DATANG
en: to pay her

source: MISKIN BANGET SIH HAPE CUMA SATU?!!!
en: is he so poor that he only has one phone?

source: KITA BURUK DI
en: our reputation,

source: KALO SUATU SAAT NANTI GUE BUTUH PERTOLONGAN, GUE BAKAL BILANG KOK KE LO.
en: if I ever need your help, I’ll definitely come to you.

source: SEKARANG.
en: on her thesis now.

source: -JAUH AH BAHAYA...
en: to wander off too far.

source: APA SIH...
en: talking about...

source: ANAK KELAS GUA.
en: my classmate.

source: jika ada kesamaan nama tokoh, tempat kejadian, ataupun cerita,
en: any similarity to actual persons, living or dead, or actual events,

source: kita kayak dulu lagi…
en: to go back to the way we used to be.

source: Padahal gua sendiri juga gak berani menghadapi perasaan gua.
en: but I didn’t even have the guts to face my feelings.

source: Ya udah, itu dulu aja ya.
en: good. well, I guess that’s about it.

source: IYA SIH
en: really

source: Neng Ayu kok gak bilang ya punya temen tukang kunci
en: I didn’t know laras had a locksmith friend.

source: TENTANG KARYA
en: my artwork,

source: TEORI DAN
en: and

source: PERLAHAN-LAHAN, GUE BAKAL BEBAS
en: sooner or later,

source: URUSAN RADI KAN BISA URUSAN GUE.
en: I can handle radi myself.
